Repository: xaron98/spiral-journey
Catalog: spiral journey project/Localizable.xcstrings
Source language: en
Languages: ar, ca, de, es, fr, ja, pt_br, zh_hans

# coach.patterns.insight.streak
source: Best habit streak
es: Racha mejor hábito

# coach.patterns.insight.streak.sub
source: November
es: Noviembre

# coach.patterns.insight.streak.value
source: 12 days
es: 12 días

# coach.patterns.insight.trend
source: 30d trend
es: Tendencia 30d

# coach.patterns.insight.trend.sub
source: Improving
es: Mejorando

# coach.patterns.title
source: Patterns
es: Patrones

# coach.plan.bedtimeAt
source: GO TO BED AT
es: ACUÉSTATE A LAS

# coach.plan.countdown
source: in %dh %dmin
es: en %dh %dmin

# coach.plan.cta.enableReminder
source: Enable reminder
es: Activar recordatorio

# coach.plan.cta.reminderActive
source: Reminder active
es: Recordatorio activo

# coach.plan.description
source: 40 min earlier than yesterday. Enough to notice the difference tomorrow.
es: 40 min antes que ayer. Suficiente para que mañana notes la diferencia.

# coach.plan.header
source: PLAN · TONIGHT
es: PLAN · ESTA NOCHE

# coach.plan.headline
source: A small step to break the streak
es: Un paso pequeño para cortar la racha

# coach.plan.preparation
source: SUGGESTED PREPARATION
es: PREPARACIÓN SUGERIDA

# coach.plan.reminder.body
source: Your optimal window is at %@. Give your body a minute.
es: Tu ventana óptima está en %@. Dale un minuto al cuerpo.

# coach.plan.reminder.denied
source: I need notification permission to remind you.
es: Necesito permiso de notificaciones para avisarte.

# coach.plan.reminder.failed
source: Couldn't schedule the reminder. Try again.
es: No pude programar el recordatorio. Inténtalo de nuevo.

# coach.plan.reminder.title
source: Time for bed
es: Hora de acostarse

# coach.plan.reminder.unsupported
source: Reminders aren't available on this device.
es: Recordatorios no disponibles en este dispositivo.

# coach.plan.step1.detail
source: Screens in warm mode
es: Pantallas en modo cálido

# coach.plan.step1.label
source: Dim the lights
es: Atenúa luces

# coach.plan.step2.detail
source: Last cup 8h before
es: Última taza 8h antes

# coach.plan.step2.label
source: No caffeine
es: Sin cafeína

# coach.plan.step3.detail
source: Brush teeth, read 5 min
es: Cepíllate, lee 5 min

# coach.plan.step3.label
source: Short routine
es: Rutina corta

# coach.plan.step4.detail
source: Goal
es: Objetivo

# coach.plan.step4.label
source: Lights out
es: Luces apagadas

# codon.help.bars.body
source: Each bar represents one night. Green = good cycle transitions. Yellow = moderate. Red = many disruptions. The height shows the integrity score — taller bars mean better sleep architecture that night.
es: Cada barra representa una noche. Verde = buenas transiciones de ciclo. Amarillo = moderado. Rojo = muchas disrupciones. La altura muestra la integridad — barras más altas significan mejor arquitectura de sueño esa noche.

# codon.help.bars.title
source: What do the bars mean?
es: Qué significan las barras?

# codon.help.disclaimer
source: Requires Apple Watch sleep stage data. Analysis based on bioinformatics k-mer technique applied to sleep phases.
es: Requiere datos de fases de sueño del Apple Watch. Análisis basado en técnica bioinformática de k-mers aplicada a fases de sueño.

# codon.help.disruption.body
source: A disruption is when a sleep phase is interrupted unexpectedly — like waking up in the middle of REM sleep or deep sleep. The most common disruption pattern is shown so you can identify what breaks your sleep cycles most often.
es: Una disrupción es cuando una fase de sueño se interrumpe inesperadamente — como despertarte en medio del REM o del sueño profundo. Se muestra el patrón de disrupción más común para que puedas identificar qué rompe tus ciclos de sueño con más frecuencia.

# codon.help.disruption.title
source: What is a disruption?
es: Qué es una disrupción?

# codon.help.title
source: Sleep architecture
es: Arquitectura del sueño

# codon.help.what.body
source: We analyze how your sleep phases transition during the night: light sleep, deep sleep, REM, and awakenings. A healthy night follows a predictable cycle (light → deep → REM). When this cycle breaks — for example, waking up during REM — it affects the quality of your rest.
es: Analizamos cómo transicionan tus fases de sueño durante la noche: sueño ligero, sueño profundo, REM y despertares. Una noche saludable sigue un ciclo predecible (ligero → profundo → REM). Cuando este ciclo se rompe — por ejemplo, despertarse durante el REM — afecta la calidad de tu descanso.

# codon.help.what.title
source: What is this?
es: Qué es esto?

# comparison.days %lld
source: %lld days
es: %lld días

# comparison.metric.bedtime
source: Bedtime
es: Hora de acostarse

# comparison.metric.chronotype
source: Chronotype
es: Cronotipo

# comparison.metric.coherence
source: Coherence
es: Coherencia

# comparison.metric.consistency
source: Consistency
es: Consistencia

# comparison.metric.duration
source: Duration
es: Duración

# comparison.metric.fragmentation
source: Fragmentation
es: Fragmentación

# comparison.metric.regularity
source: Regularity (SRI)
es: Regularidad (SRI)

# comparison.metric.socialJetlag
source: Social jet lag
es: Jet lag social

# comparison.metric.wake
source: Wake time
es: Hora de despertar

# comparison.sharingAs
source: Sharing as %@
es: Compartiendo como %@

# consistency.temporal.ai.button
source: Explain with AI
es: Explicar con IA

# consistency.temporal.anomalies
source: %d anomalous nights detected
es: %d noches anómalas detectadas

# consistency.temporal.baseline
source: Baseline: %.1f awakenings per night
es: Base: %.1f despertares por noche

# consistency.temporal.caffeine
source: Caffeine
es: Cafeína

# consistency.temporal.delay
source: Effect after ~%dh
es: Efecto tras ~%dh

# consistency.temporal.exercise
source: Exercise
es: Ejercicio

# consistency.temporal.impact
source: %@ causes %d%% more awakenings at night
es: %@ provoca un %d%% más de despertares nocturnos

# consistency.temporal.impact.positive
source: %@ reduces awakenings by %d%%
es: %@ reduce los despertares un %d%%

# consistency.temporal.light
source: Light
es: Luz

# consistency.temporal.melatonin
source: Melatonin
es: Melatonina

# consistency.temporal.pattern
source: Your awakenings follow a pattern — not random
es: Tus despertares siguen un patrón — no son aleatorios

# consistency.temporal.random
source: Your awakenings appear random
es: Tus despertares parecen aleatorios

# consistency.temporal.stress
source: Stress
es: Estrés

# consistency.temporal.title
source: Temporal impact
es: Impacto temporal

source: Day
es: Día

source: Drift
es: Desplazamiento

source: Duration
es: Duración

source: Hour
es: Hora

# mode.dna.header
source: Your patterns
es: Tus patrones

# mode.spiral.good_afternoon
source: Good afternoon
es: Buenas tardes

# mode.spiral.good_morning
source: Good morning
es: Buenos días

# mode.spiral.good_night
source: Good night
es: Buenas noches

# mode.torus.last_night
source: Last night
es: Anoche

# mode.torus.no_data
source: No data
es: Sin datos

source: Pause
es: Pausa

source: Period
es: Período

# periodogram.signal.hrv
source: HRV
es: VFC

source: Play
es: Reproducir

source: Power
es: Potencia

source: Response
es: Respuesta

source: Send message
es: Enviar mensaje

# spiral.a11y.label
source: Sleep spiral
es: Espiral de sueño

# spiral.controls.revealAnimation
source: Reveal animation
es: Animación de revelado

# spiral.undo.button
source: Undo
es: Deshacer

# spiral.undo.registered
source: Recorded
es: Registrado

source: Stop generating
es: Detener

# sync.updating
source: Updating…
es: Actualizando…

# temporal.help.delay.body
source: Some factors may not affect your sleep immediately. We use the Hawkes process (Hawkes, 1971, Biometrika) — a self-exciting model validated in seismology (ETAS earthquake aftershock model), finance (market crash cascades), epidemiology (COVID-19 contagion chains), and neuroscience (neural spike train modeling, Pillow et al. 2008). Its application to sleep is EXPERIMENTAL and original to this app — there are no published studies validating this specific use. The delayed effects shown are correlations from your data, not proven causation.
es: Algunos factores pueden no afectar tu sueño inmediatamente. Usamos el proceso de Hawkes (Hawkes, 1971, Biometrika) — un modelo auto-excitado validado en sismología (modelo ETAS de réplicas de terremotos), finanzas (cascadas de crashes bursátiles), epidemiología (cadenas de contagio COVID-19) y neurociencia (modelado de trenes de impulsos neuronales, Pillow et al. 2008). Su aplicación al sueño es EXPERIMENTAL y original de esta app — no existen estudios publicados que validen este uso específico. Los efectos retardados mostrados son correlaciones de tus datos, no causalidad demostrada.

# temporal.help.delay.title
source: What is the delay effect?
es: Qué es el efecto retardado?

# temporal.help.disclaimer
source: The Poisson process and chi-squared test are established science. The Hawkes application to sleep is an experimental hypothesis. Correlations from your data — not medical advice.
es: El proceso de Poisson y la prueba chi-cuadrado son ciencia establecida. La aplicación de Hawkes al sueño es una hipótesis experimental. Correlaciones de tus datos — no es consejo médico.

# temporal.help.how.body
source: We compare your nights WITH a specific factor (caffeine, exercise, stress) against nights WITHOUT it. The percentage shows how much more (or less) you wake up. This is measured using regression analysis across all your historical data.
es: Comparamos tus noches CON un factor específico (cafeína, ejercicio, estrés) contra noches SIN él. El porcentaje muestra cuánto más (o menos) te despiertas. Se mide mediante análisis de regresión sobre todo tu historial de datos.

# temporal.help.how.title
source: How are the percentages calculated?
es: Cómo se calculan los porcentajes?

# temporal.help.title
source: How does it work?
es: Cómo funciona?

# temporal.help.what.body
source: We analyze how many times you wake up each night and calculate your personal baseline. Using the Poisson process (Poisson, 1837; Lundberg, 1903) — a mathematical model validated for over a century in fields like physics, telecommunications and insurance — we detect which nights had statistically anomalous awakenings.
es: Analizamos cuántas veces te despiertas cada noche y calculamos tu base personal. Usando el proceso de Poisson (Poisson, 1837; Lundberg, 1903) — un modelo matemático validado durante más de un siglo en campos como física, telecomunicaciones y seguros — detectamos qué noches tuvieron despertares estadísticamente anómalos.

# temporal.help.what.title
source: What is temporal impact?
es: Qué es el impacto temporal?

source: Threshold
es: Umbral

source: Value
es: Valor

source: Wake
es: Despertar

source: Zero
es: Cero

# dna.codon.phase.rem
source: REM
ja: レム睡眠

# triangle.pole.rem
source: REM
ja: レム
